In [1]:
import requests
import pandas as pd
from config import weather_api_key

In [2]:
url = "http://api.openweathermap.org/data/2.5/weather?"
units = "imperial"

query_url = f"{url}appid={weather_api_key}&units={units}&q="

In [3]:
states = ["Alabama", "Alaska", "Arizona", "Arkansas", "California", "Colorado", "Connecticut", "Delaware", "Florida", "Georgia",
          "Hawaii", "Idaho", "Illinois", "Indiana", "Iowa", "Kansas", "Kentucky", "Louisiana", "Maine", "Maryland",
          "Massachusetts", "Michigan", "Minnesota", "Mississippi", "Missouri", "Montana", "Nebraska", "Nevada", "New Hampshire",
          "New Jersey", "New Mexico", "New York", "North Carolina", "North Dakota", "Ohio", "Oklahoma", "Oregon",
          "Pennsylvania", "Rhode Island", "South Carolina", "South Dakota", "Tennessee", "Texas", "Utah", "Vermont",
          "Virginia", "Washington", "West Virginia", "Wisconsin", "Wyoming"]

abbr = ["AL", "AK", "AZ", "AR", "CA", "CO", "CT", "DE", "FL", "GA", "HI", "ID", "IL", "IN", "IA", "KS", "KY", "LA", "ME", "MD",
       "MA", "MI", "MN", "MS", "MO", "MT", "NE", "NV", "NH", "NJ", "NM", "NY", "NC", "ND", "OH", "OK", "OR", "PA", "RI", "SC",
       "SD", "TN", "TX", "UT", "VT", "VA", "WA", "WV", "WI", "WY"]


cities = ["Birmingham", "Anchorage", "Phoenix", "Little Rock", "Los Angeles", "Denver", "Bridgeport", "Wilmington", "Jacksonville",
         "Atlanta", "Honolulu", "Boise", "Chicago", "Indianapolis", "Des Moines", "Wichita", "Louisville", "New Orleans", "Portland",
         "Baltimore", "Boston", "Detroit", "Minneapolis", "Jackson", "Kansas City", "Billings", "Omaha", "Las Vegas", 
         "Manchester", "Newark", "Albuquerque", "New York City", "Charlotte", "Fargo", "Columbus", "Oklahoma City", "Portland",
         "Philadelphia", "Providence", "Charleston", "Sioux Falls", "Nashville", "Houston", "Salt Lake City", "Burlington",
         "Virginia Beach", "Seattle", "Charleston", "Milwaukee", "Cheyenne"]

temp = []
dic = []

for city in cities:
    response = requests.get(query_url + city).json()
    a = {
        "city": city,
        "temp": response['main']['temp']
    }
    dic.append(a)
    temp.append(response['main']['temp'])

In [4]:
weather_data = pd.DataFrame(dic)
weather_data.head()

          city   temp
0   Birmingham  66.09
1    Anchorage   7.81
2      Phoenix  68.02
3  Little Rock  66.22
4  Los Angeles  69.76

In [5]:
weather_data['state'] = states
weather_data['abbr'] = abbr

In [6]:
weather_data.head()

          city   temp       state abbr
0   Birmingham  66.09     Alabama   AL
1    Anchorage   7.81      Alaska   AK
2      Phoenix  68.02     Arizona   AZ
3  Little Rock  66.22    Arkansas   AR
4  Los Angeles  69.76  California   CA

In [7]:
weather_df = weather_data[['state', 'abbr', 'city', 'temp']]

In [8]:
weather_df.head()

        state abbr         city   temp
0     Alabama   AL   Birmingham  66.09
1      Alaska   AK    Anchorage   7.81
2     Arizona   AZ      Phoenix  68.02
3    Arkansas   AR  Little Rock  66.22
4  California   CA  Los Angeles  69.76

In [9]:
from splinter import Browser
from bs4 import BeautifulSoup as bs
from webdriver_manager.chrome import ChromeDriverManager
import lxml.html as lh

In [10]:
#setup splinter
executable_path = {'executable_path': ChromeDriverManager().install()}
browser = Browser('chrome', **executable_path, headless=False)

[WDM] - Current google-chrome version is 88.0.4324
[WDM] - Get LATEST driver version for 88.0.4324
[WDM] - Driver [C:\Users\Robert Anthony\.wdm\drivers\chromedriver\win32\88.0.4324.96\chromedriver.exe] found in cache

In [11]:
url = "https://dqydj.com/average-income-by-state-median-top-percentiles/"
browser.visit(url)
#Create a handle, page, to handle the contents of the website
page = requests.get(url)
#Store the contents of the website under doc
doc = lh.fromstring(page.content)
#Parse data that are stored between <tr>..</tr> of HTML
tr_elements = doc.xpath('//tr')

In [12]:
#Check the length of the first 12 rows
[len(T) for T in tr_elements[:12]]

[2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]

In [13]:
#Create empty list
col=[]
i=0
#For each row, store each first element (header) and an empty list
for t in tr_elements[0]:
    i+=1
    name=t.text_content()
    print(i,name)
    col.append((name,[]))

1 State
2 Average Income

In [14]:
for j in range(53, 104):
    #T is our j'th row
    T=tr_elements[j]
    
    #If row is not of size 4, the //tr data is not from our table 
    if len(T)!=2:
        break
    
    #i is the index of our column
    i=0
    
    #Iterate through each element of the row
    for t in T.iterchildren():
        data=t.text_content() 
        #Check if row is empty
        if i>0:
        #Convert any numerical value to integers
            try:
                data=int(data)
            except:
                pass
        #Append the data to the empty list of the i'th column
        col[i][1].append(data)
        #Increment i for the next column
        i+=1

In [15]:
[len(C) for (title,C) in col]

[51, 51]

In [16]:
Dict={title:column for (title,column) in col}
median_df=pd.DataFrame(Dict)

In [17]:
browser.quit()

In [18]:
median_df.head()

        State Average Income
0     Alabama     $55,935.00
1      Alaska     $78,038.00
2     Arizona     $70,080.00
3    Arkansas     $54,322.00
4  California     $78,002.00

In [19]:
median_df = median_df.rename(columns={"State": "state", "Average Income": "median income"})

In [20]:
median_df = median_df.drop(median_df.index[[8]])

In [21]:
merged_df = pd.merge(left=weather_df, right=median_df, left_on='state', right_on='state')

In [22]:
merged_df.head()

        state abbr         city   temp median income
0     Alabama   AL   Birmingham  66.09    $55,935.00
1      Alaska   AK    Anchorage   7.81    $78,038.00
2     Arizona   AZ      Phoenix  68.02    $70,080.00
3    Arkansas   AR  Little Rock  66.22    $54,322.00
4  California   CA  Los Angeles  69.76    $78,002.00

In [23]:
#poverty csv
poverty_df = pd.read_csv("../Data/Rob/State_Poverty.csv")

In [24]:
poverty_df.head()

           State  PovertyRate  undefined
0    Mississippi       0.1975     585786
1      Louisiana       0.1883     871467
2     New Mexico       0.1863     392065
3  West Virginia       0.1754     310044
4       Kentucky       0.1667     747010

In [25]:
poverty_df = poverty_df.drop(columns=['undefined'])

In [26]:
poverty_df = poverty_df.rename(columns = {'State': 'state', 'PovertyRate': 'poverty'})

In [27]:
poverty_df.head()

           state  poverty
0    Mississippi   0.1975
1      Louisiana   0.1883
2     New Mexico   0.1863
3  West Virginia   0.1754
4       Kentucky   0.1667

In [28]:
poverty_df = poverty_df.sort_values('state')

In [29]:
poverty_df = poverty_df.reset_index(drop = True)

In [30]:
poverty_df["poverty"] = 100 * poverty_df["poverty"]

In [31]:
poverty_df.head()

        state  poverty
0     Alabama    16.13
1      Alaska    10.62
2     Arizona    13.88
3    Arkansas    16.36
4  California    13.00

In [32]:
merged_df_2 = pd.merge(left=merged_df, right=poverty_df, left_on='state', right_on='state')

In [33]:
merged_df_2.head()

        state abbr         city   temp median income  poverty
0     Alabama   AL   Birmingham  66.09    $55,935.00    16.13
1      Alaska   AK    Anchorage   7.81    $78,038.00    10.62
2     Arizona   AZ      Phoenix  68.02    $70,080.00    13.88
3    Arkansas   AR  Little Rock  66.22    $54,322.00    16.36
4  California   CA  Los Angeles  69.76    $78,002.00    13.00

In [34]:
merged_df_2 = merged_df_2.replace(',', '', regex=True)

In [35]:
merged_df_2['median income'] = merged_df_2['median income'].str.replace('$', '')

In [36]:
merged_df_2.head()

        state abbr         city   temp median income  poverty
0     Alabama   AL   Birmingham  66.09      55935.00    16.13
1      Alaska   AK    Anchorage   7.81      78038.00    10.62
2     Arizona   AZ      Phoenix  68.02      70080.00    13.88
3    Arkansas   AR  Little Rock  66.22      54322.00    16.36
4  California   CA  Los Angeles  69.76      78002.00    13.00

In [37]:
merged_df_2['median income'] = merged_df_2['median income'].astype(float)

In [38]:
merged_df_2 = merged_df_2.round(1)

In [39]:
merged_df_2.head()

        state abbr         city  temp  median income  poverty
0     Alabama   AL   Birmingham  66.1        55935.0     16.1
1      Alaska   AK    Anchorage   7.8        78038.0     10.6
2     Arizona   AZ      Phoenix  68.0        70080.0     13.9
3    Arkansas   AR  Little Rock  66.2        54322.0     16.4
4  California   CA  Los Angeles  69.8        78002.0     13.0

In [40]:
from splinter import Browser
from bs4 import BeautifulSoup as bs
from webdriver_manager.chrome import ChromeDriverManager
import lxml.html as lh

In [41]:
#setup splinter
executable_path = {'executable_path': ChromeDriverManager().install()}
browser = Browser('chrome', **executable_path, headless=False)

[WDM] - Current google-chrome version is 88.0.4324
[WDM] - Get LATEST driver version for 88.0.4324
[WDM] - Driver [C:\Users\Robert Anthony\.wdm\drivers\chromedriver\win32\88.0.4324.96\chromedriver.exe] found in cache

In [42]:
#Mean travel time to work (minutes), workers age 16 years+, 2014-2018
url = "https://www.indexmundi.com/facts/united-states/quick-facts/all-states/average-commute-time#table"
browser.visit(url)
#Create a handle, page, to handle the contents of the website
page = requests.get(url)
#Store the contents of the website under doc
doc = lh.fromstring(page.content)
#Parse data that are stored between <tr>..</tr> of HTML
tr_elements = doc.xpath('//tr')

In [43]:
#Check the length of the first 12 rows
[len(T) for T in tr_elements[:12]]

[2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]

In [44]:
#Create empty list
col=[]
i=0
#For each row, store each first element (header) and an empty list
for t in tr_elements[0]:
    i+=1
    name=t.text_content()
    print(i,name)
    col.append((name,[]))

1 State
2 Value

In [45]:
for j in range(0, 52):
    #T is our j'th row
    T=tr_elements[j]
    
    #If row is not of size 4, the //tr data is not from our table 
    if len(T)!=2:
        break
    
    #i is the index of our column
    i=0
    
    #Iterate through each element of the row
    for t in T.iterchildren():
        data=t.text_content() 
        #Check if row is empty
        if i>0:
        #Convert any numerical value to integers
            try:
                data=int(data)
            except:
                pass
        #Append the data to the empty list of the i'th column
        col[i][1].append(data)
        #Increment i for the next column
        i+=1

In [46]:
[len(C) for (title,C) in col]

[52, 52]

In [47]:
Dict={title:column for (title,column) in col}
commute_df=pd.DataFrame(Dict)

In [48]:
commute_df = commute_df.drop([0, 9])

In [49]:
commute_df = commute_df.reset_index(drop=True)

In [50]:
commute_df = commute_df.rename(columns={"State": "state", "Value": "commute"})

In [51]:
browser.quit()

In [52]:
commute_df.head()

        state commute
0     Alabama    24.7
1      Alaska    18.8
2     Arizona    25.3
3    Arkansas    21.7
4  California    29.3

In [53]:
merged_df_3 = pd.merge(left=merged_df_2, right=commute_df, left_on='state', right_on='state')

In [54]:
merged_df_3.head()

        state abbr         city  temp  median income  poverty commute
0     Alabama   AL   Birmingham  66.1        55935.0     16.1    24.7
1      Alaska   AK    Anchorage   7.8        78038.0     10.6    18.8
2     Arizona   AZ      Phoenix  68.0        70080.0     13.9    25.3
3    Arkansas   AR  Little Rock  66.2        54322.0     16.4    21.7
4  California   CA  Los Angeles  69.8        78002.0     13.0    29.3

In [55]:
#health_rankings csv
health_df = pd.read_csv("../Data/Rob/Health_Rankings.csv")

In [56]:
health_df = health_df.drop(columns=['RANK'])

In [57]:
health_df = health_df.rename(columns={'STATE': 'state', 'VALUE': 'health'})

In [58]:
health_df.head()

        state  health
0     Alabama  -0.838
1      Alaska  -0.115
2     Arizona  -0.105
3    Arkansas  -0.672
4  California   0.431

In [59]:
merged_df_4 = pd.merge(left=merged_df_3, right=health_df, left_on='state', right_on='state')

In [60]:
merged_df_4.head()

        state abbr         city  temp  median income  poverty commute  health
0     Alabama   AL   Birmingham  66.1        55935.0     16.1    24.7  -0.838
1      Alaska   AK    Anchorage   7.8        78038.0     10.6    18.8  -0.115
2     Arizona   AZ      Phoenix  68.0        70080.0     13.9    25.3  -0.105
3    Arkansas   AR  Little Rock  66.2        54322.0     16.4    21.7  -0.672
4  California   CA  Los Angeles  69.8        78002.0     13.0    29.3   0.431

In [61]:
merged_df_4 = merged_df_4.round(3)

In [62]:
merged_df_4 = merged_df_4.rename(columns={'median income': 'm_income'})

In [63]:
merged_df_4.head()

        state abbr         city  temp  m_income  poverty commute  health
0     Alabama   AL   Birmingham  66.1   55935.0     16.1    24.7  -0.838
1      Alaska   AK    Anchorage   7.8   78038.0     10.6    18.8  -0.115
2     Arizona   AZ      Phoenix  68.0   70080.0     13.9    25.3  -0.105
3    Arkansas   AR  Little Rock  66.2   54322.0     16.4    21.7  -0.672
4  California   CA  Los Angeles  69.8   78002.0     13.0    29.3   0.431

In [64]:
health_list = merged_df_4['health'].tolist()

In [65]:
#normalize neg & pos values in health_list to range(0, 2)
old_min = min(health_list)
old_range = max(health_list) - old_min

In [66]:
new_min = 1
new_range = 1.2 + 0.9999999999 - new_min
new_health =[]
for n in health_list:
    output = ((n - old_min) / old_range * new_range + new_min)
    new_health.append(output)

In [67]:
merged_df_4['new_health'] = new_health

In [68]:
merged_df_4 = merged_df_4.rename(columns={'health': 'old_health', 'new_health': 'health'})

In [69]:
merged_df_4 = merged_df_4.round(3)

In [70]:
merged_df_4.head()

,state,abbr,city,temp,m_income,poverty,commute,old_health,health
0,Alabama,AL,Birmingham,66.1,55935.0,16.1,24.7,-0.838,1.115
1,Alaska,AK,Anchorage,7.8,78038.0,10.6,18.8,-0.115,1.571
2,Arizona,AZ,Phoenix,68.0,70080.0,13.9,25.3,-0.105,1.578
3,Arkansas,AR,Little Rock,66.2,54322.0,16.4,21.7,-0.672,1.220
4,California,CA,Los Angeles,69.8,78002.0,13.0,29.3,0.431,1.916

In [71]:
from splinter import Browser
from bs4 import BeautifulSoup as bs
from webdriver_manager.chrome import ChromeDriverManager
import lxml.html as lh

In [72]:
#setup splinter
executable_path = {'executable_path': ChromeDriverManager().install()}
browser = Browser('chrome', **executable_path, headless=False)

[WDM] - Current google-chrome version is 88.0.4324
[WDM] - Get LATEST driver version for 88.0.4324
[WDM] - Driver [C:\Users\Robert Anthony\.wdm\drivers\chromedriver\win32\88.0.4324.96\chromedriver.exe] found in cache

In [73]:
#Mean travel time to work (minutes), workers age 16 years+, 2014-2018
url = "https://www.indexmundi.com/facts/united-states/quick-facts/all-states/homeownership-rate#table"
browser.visit(url)
#Create a handle, page, to handle the contents of the website
page = requests.get(url)
#Store the contents of the website under doc
doc = lh.fromstring(page.content)
#Parse data that are stored between <tr>..</tr> of HTML
tr_elements = doc.xpath('//tr')

In [74]:
#Check the length of the first 12 rows
[len(T) for T in tr_elements[:12]]

[2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]

In [75]:
#Create empty list
col=[]
i=0
#For each row, store each first element (header) and an empty list
for t in tr_elements[0]:
    i+=1
    name=t.text_content()
    print(i,name)
    col.append((name,[]))

1 State
2 Value

In [76]:
for j in range(0, 52):
    #T is our j'th row
    T=tr_elements[j]
    
    #If row is not of size 4, the //tr data is not from our table 
    if len(T)!=2:
        break
    
    #i is the index of our column
    i=0
    
    #Iterate through each element of the row
    for t in T.iterchildren():
        data=t.text_content() 
        #Check if row is empty
        if i>0:
        #Convert any numerical value to integers
            try:
                data=int(data)
            except:
                pass
        #Append the data to the empty list of the i'th column
        col[i][1].append(data)
        #Increment i for the next column
        i+=1

In [77]:
[len(C) for (title,C) in col]

[52, 52]

In [78]:
Dict={title:column for (title,column) in col}
ownership_df=pd.DataFrame(Dict)

In [79]:
browser.quit()

In [80]:
ownership_df.head()

      State  Value
0     State  Value
1   Alabama   68.6
2    Alaska   64.0
3   Arizona   63.6
4  Arkansas   65.7

In [81]:
ownership_df = ownership_df.drop([0, 9])

In [82]:
ownership_df = ownership_df.reset_index(drop=True)

In [83]:
ownership_df = ownership_df.rename(columns={"State": "state", "Value": "ownership"})

In [84]:
ownership_df.head()

        state ownership
0     Alabama      68.6
1      Alaska      64.0
2     Arizona      63.6
3    Arkansas      65.7
4  California      54.6

In [85]:
merged_df_5 = pd.merge(left=merged_df_4, right=ownership_df, left_on='state', right_on='state')

In [86]:
merged_df_5.head()

,state,abbr,city,temp,m_income,poverty,commute,old_health,health,ownership
0,Alabama,AL,Birmingham,66.1,55935.0,16.1,24.7,-0.838,1.115,68.6
1,Alaska,AK,Anchorage,7.8,78038.0,10.6,18.8,-0.115,1.571,64.0
2,Arizona,AZ,Phoenix,68.0,70080.0,13.9,25.3,-0.105,1.578,63.6
3,Arkansas,AR,Little Rock,66.2,54322.0,16.4,21.7,-0.672,1.220,65.7
4,California,CA,Los Angeles,69.8,78002.0,13.0,29.3,0.431,1.916,54.6

In [87]:
from splinter import Browser
from bs4 import BeautifulSoup as bs
from webdriver_manager.chrome import ChromeDriverManager
import lxml.html as lh

In [88]:
#setup splinter
executable_path = {'executable_path': ChromeDriverManager().install()}
browser = Browser('chrome', **executable_path, headless=False)

[WDM] - Current google-chrome version is 88.0.4324
[WDM] - Get LATEST driver version for 88.0.4324
[WDM] - Driver [C:\Users\Robert Anthony\.wdm\drivers\chromedriver\win32\88.0.4324.96\chromedriver.exe] found in cache

In [89]:
#Mean travel time to work (minutes), workers age 16 years+, 2014-2018
url = "https://www.currentresults.com/Weather/US/average-annual-state-precipitation.php"
browser.visit(url)
#Create a handle, page, to handle the contents of the website
page = requests.get(url)
#Store the contents of the website under doc
doc = lh.fromstring(page.content)
#Parse data that are stored between <tr>..</tr> of HTML
tr_elements = doc.xpath('//tr')

In [90]:
#Check the length of the first 12 rows
[len(T) for T in tr_elements[:12]]

[4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]

In [91]:
#Create empty list
col=[]
i=0
#For each row, store each first element (header) and an empty list
for t in tr_elements[0]:
    i+=1
    name=t.text_content()
    print(i,name)
    col.append((name,[]))

1 State
2 Inches
3 Milli­metres
4 Rank

In [92]:
for j in range(0, 53):
    #T is our j'th row
    T=tr_elements[j]
    
    #If row is not of size 4, the //tr data is not from our table 
    if len(T)!=4:
        break
    
    #i is the index of our column
    i=0
    
    #Iterate through each element of the row
    for t in T.iterchildren():
        data=t.text_content() 
        #Check if row is empty
        if i>0:
        #Convert any numerical value to integers
            try:
                data=int(data)
            except:
                pass
        #Append the data to the empty list of the i'th column
        col[i][1].append(data)
        #Increment i for the next column
        i+=1

In [93]:
[len(C) for (title,C) in col]

[53, 53, 53, 53]

In [94]:
Dict={title:column for (title,column) in col}
precipitation_df=pd.DataFrame(Dict)

In [95]:
browser.quit()

In [96]:
precipitation_df.head()

      State  Inches  Milli­metres  Rank
0     State  Inches  Milli­metres  Rank
1   Alabama    58.3          1480     4
2    Alaska    22.5           572    39
3   Arizona    13.6           345    47
4  Arkansas    50.6          1284     8

In [97]:
precipitation_df = precipitation_df.drop([0, 18, 36])

In [98]:
precipitation_df = precipitation_df.reset_index(drop=True)

In [99]:
precipitation_df = precipitation_df.rename(columns={"State": "state", "Inches": "precip"})

In [100]:
precipitation_df = precipitation_df.drop(columns=['Milli­metres', 'Rank'])

In [101]:
precipitation_df.head()

        state precip
0     Alabama   58.3
1      Alaska   22.5
2     Arizona   13.6
3    Arkansas   50.6
4  California   22.2

In [102]:
merged_df_6 = pd.merge(left=merged_df_5, right=precipitation_df, left_on='state', right_on='state')

In [103]:
merged_df_6.head()

,state,abbr,city,temp,m_income,poverty,commute,old_health,health,ownership,precip
0,Alabama,AL,Birmingham,66.1,55935.0,16.1,24.7,-0.838,1.115,68.6,58.3
1,Alaska,AK,Anchorage,7.8,78038.0,10.6,18.8,-0.115,1.571,64.0,22.5
2,Arizona,AZ,Phoenix,68.0,70080.0,13.9,25.3,-0.105,1.578,63.6,13.6
3,Arkansas,AR,Little Rock,66.2,54322.0,16.4,21.7,-0.672,1.220,65.7,50.6
4,California,CA,Los Angeles,69.8,78002.0,13.0,29.3,0.431,1.916,54.6,22.2

In [104]:
#health_rankings csv
median_home_df = pd.read_csv("../Data/Rob/Median_Home.csv")

In [105]:
median_home_df = median_home_df.rename(columns={'State': 'state', 'MedianValue': 'm_home'})

In [106]:
median_home_df.head()

           state  m_home
0         Hawaii  615300
1     California  505000
2  Massachusetts  381600
3       Colorado  343300
4     Washington  339000

In [107]:
merged_df_7 = pd.merge(left=merged_df_6, right=median_home_df, left_on='state', right_on='state')

In [108]:
merged_df_7.head()

,state,abbr,city,temp,m_income,poverty,commute,old_health,health,ownership,precip,m_home
0,Alabama,AL,Birmingham,66.1,55935.0,16.1,24.7,-0.838,1.115,68.6,58.3,142700
1,Alaska,AK,Anchorage,7.8,78038.0,10.6,18.8,-0.115,1.571,64.0,22.5,270400
2,Arizona,AZ,Phoenix,68.0,70080.0,13.9,25.3,-0.105,1.578,63.6,13.6,225500
3,Arkansas,AR,Little Rock,66.2,54322.0,16.4,21.7,-0.672,1.220,65.7,50.6,127800
4,California,CA,Los Angeles,69.8,78002.0,13.0,29.3,0.431,1.916,54.6,22.2,505000

In [110]:
#migration out csv
m_out_df = pd.read_csv("../Data/Rob/Migration_Out.csv")

In [111]:
counts = []
# for state in states:
for state in states:   
    sum_total = m_out_df.loc[(m_out_df.Origin == f'{state}')].sum()
    count = sum_total['Total']
    counts.append(count)

In [112]:
len(counts)

50

In [113]:
migration_out_df = pd.DataFrame({'state': states, 'm_out': counts})

In [114]:
migration_out_df.head()

        state   m_out
0     Alabama   50039
1      Alaska   23220
2     Arizona   98154
3    Arkansas   36459
4  California  368821

In [115]:
#migration in csv
m_in_df = pd.read_csv("../Data/Rob/Migration_In.csv")

In [116]:
counts_2 = []
# for state in states:
for state in states:   
    sum_total = m_in_df.loc[(m_in_df.To_State == f'{state}')].sum()
    count = sum_total['Total']
    counts_2.append(count)

In [117]:
len(counts)

50

In [118]:
migration_in_df = pd.DataFrame({'state': states, 'm_in': counts_2})

In [119]:
migration_in_df.head()

        state    m_in
0     Alabama   58866
1      Alaska   16541
2     Arizona  156164
3    Arkansas   38059
4  California  294078

In [120]:
merged_df_8 = pd.merge(left=merged_df_7, right=migration_out_df, left_on='state', right_on='state')

In [122]:
merged_df_9 = pd.merge(left=merged_df_8, right=migration_in_df, left_on='state', right_on='state')

In [124]:
merged_df_9 = merged_df_9[['state', 'abbr', 'm_in', 'm_out', 'health', 'commute', 'ownership', 'm_home', 'm_income', 'poverty', 'temp', 'precip']]

In [126]:
merged_df_9.head()

,state,abbr,m_in,m_out,health,commute,ownership,m_home,m_income,poverty,temp,precip
0,Alabama,AL,58866,50039,1.115,24.7,68.6,142700,55935.0,16.1,66.1,58.3
1,Alaska,AK,16541,23220,1.571,18.8,64.0,270400,78038.0,10.6,7.8,22.5
2,Arizona,AZ,156164,98154,1.578,25.3,63.6,225500,70080.0,13.9,68.0,13.6
3,Arkansas,AR,38059,36459,1.220,21.7,65.7,127800,54322.0,16.4,66.2,50.6
4,California,CA,294078,368821,1.916,29.3,54.6,505000,78002.0,13.0,69.8,22.2

In [127]:
merged_df_9.to_csv('../Data/Rob/Final_Data.csv',index=False)

In [128]:
migration_df = pd.merge(left=migration_in_df, right=migration_out_df, left_on='state', right_on='state')

In [130]:
migration_df.head()

        state    m_in   m_out
0     Alabama   58866   50039
1      Alaska   16541   23220
2     Arizona  156164   98154
3    Arkansas   38059   36459
4  California  294078  368821

In [131]:
migration_df.to_csv('../Data/Rob/Migration_In_Out.csv',index=False)